<a href="https://colab.research.google.com/github/guerlBlanchard/DBCourse/blob/main/Week_10_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [36]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db")

In [37]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student WHERE mark BETWEEN 65 AND 75"

try:
  r_set=my_conn.execute(q)
  r_list=r_set.fetchall()
  for row in r_list:
    print(row)
except SQLAlchemyError as e:
  error=str(e,__dict__['orig'])
  print(error)
else:
  print("Total Number of rows > ",len(r_list))

(1, 'John Deo', 'Four', 75, 'female')
(18, 'Honny', 'Five', 75, 'male')
(20, 'Jackly', 'Nine', 65, 'female')
(21, 'Babby John', 'Four', 69, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
Total Number of rows >  5

In [38]:
from sqlalchemy.exc import SQLAlchemyError

my_tuple=(65, 75)
q="SELECT * FROM student WHERE mark BETWEEN ? AND ?"

try:
  r_set=my_conn.execute(q, my_tuple)
  r_list=r_set.fetchall()
  for row in r_list:
    print (row)
except SQLAlchemyError as e:
  error=str(e,__dict__['orig'])
  print(error)
else:
  print("Total Number of rows > ",len(r_list))

(1, 'John Deo', 'Four', 75, 'female')
(18, 'Honny', 'Five', 75, 'male')
(20, 'Jackly', 'Nine', 65, 'female')
(21, 'Babby John', 'Four', 69, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
Total Number of rows >  5

In [39]:
from sqlalchemy.exc import SQLAlchemyError

ny_tuple=(25, 90)
q="SELECT * FROM student WHERE mark NOT BETWEEN ? AND ?"
try:
  r_set=my_conn.execute(q, my_tuple)
  r_list=r_set.fetchall()
  for row in r_list:
    print (row)
except SQLAlchemyError as e:
  error=str(e,__dict__['orig'])
  print(error)
else:
  print("Total Number of rows > ",len(r_list))

(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(12, 'Recky', 'Six', 94, 'female')
(13, 'Kty', 'Seven', 88, 'female')
(14, 'Bigy', 'Seven', 88, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(17, 'Tumyu', 'Six', 54, 'male')
(19, 'Tinny', 'Nine', 18, 'male')
(22, 'Reggid', 'Seven', 55, 'female')
(23, 'Herod', 'Eight', 79, 'male')
(24, 'Tiddy Now', 'Seven', 78, 'male')
(25, 'Giff Tow', 'Seven', 88, 'male')
(26, 'Crelea', 'Seven', 79, 'male')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(35, 'Rows Noump', 'Six', 88, 'female')
Total Number of rows >  30

In [40]:
from sqlalchemy.exc import SQLAlchemyError
my_tuple=(25,90)
q="SELECT * FROM student WHERE mark NOT BETWEEN ? AND ?"
try:
  r_set=my_conn.execute(q,my_tuple)
  r_list=r_set.fetchall()
  for row in r_list:
    print(row)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ", len(r_list))

(12, 'Recky', 'Six', 94, 'female')
(19, 'Tinny', 'Nine', 18, 'male')
(33, 'Kenn Rein', 'Six', 96, 'female')
Total Number of rows :  3

In [41]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student ORDER BY class, mark DESC"
try:
  r_set=my_conn.execute(q)
  r_list=r_set.fetchall()
  for rows in r_list:
    print(rows)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(23, 'Herod', 'Eight', 79, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(18, 'Honny', 'Five', 75, 'male')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(31, 'Marry Toeey', 'Four', 88, 'male')
(1, 'John Deo', 'Four', 75, 'female')
(21, 'Babby John', 'Four', 69, 'female')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(10, 'Big John', 'Four', 55, 'female')
(20, 'Jackly', 'Nine', 65, 'female')
(19, 'Tinny', 'Nine', 18, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(13, 'Kty', 'Seven', 88, 'female')
(14, 'Bigy', 'Seven', 88, 'female')
(25, 'Giff Tow', 'Seven', 88, 'male')
(28, 'Rojj Base', 'Seven', 86, 'female')
(26, 'Crelea', 'Seven', 79, 'male')
(24, 'Tiddy Now', 'Seven', 78, 'male')
(34, 'Gain Toe', 'Seven', 69, 'male')
(22, 'Reggid', 'Seven', 55, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(33, 'Kenn Rein', 'Six', 96, 'female')
(12, 'Recky', 'Six', 94, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(35, 'Rows Noump', 'Six', 88, 'female')
(30, 'Reppy Red', 'Six', 79, 'female')
(9, 'Tes Qry', 'Six', 78, 'male')
(17, 'Tumyu', 'Six', 54, 'male')
(2, 'Max Ruin', 'Three', 85, 'male')
(27, 'Big Nose', 'Three', 81, 'female')
(3, 'Arnold', 'Three', 55, 'male')
Total Number of rows :  35

In [42]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student WHERE class='Five' ORDER BY mark DESC"
try:
  r_set=my_conn.execute(q)
  r_list=r_set.fetchall()
  for rows in r_list:
    print(rows)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(8, 'Asruid', 'Five', 85, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(18, 'Honny', 'Five', 75, 'male')
Total Number of rows :  3

In [43]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student WHERE class='Five' ORDER BY mark DESC LIMIT 1,1"
try:
    r_set=my_conn.execute(q)
    r_list=r_set.fetchall()
    for rows in r_list:
        print(rows)
except SQLAlchemyError as e:
    error=str(e.__dict__['orig'])
    print(error)
else:
    print("Total Number of Rows: ", len(r_list))

(7, 'My John Rob', 'Five', 78, 'male')
Total Number of Rows:  1

In [44]:
import sqlite3
from employee import Employee

conn=sqlite3.connect(':memory')
c=conn.cursor()

c.execute("""CREATE TABLE employees (
          first text, 
          last text, 
          pay integer
          )""")
def insert_emp(emp):
  with conn:
    c.execute("insert into employees values (:first,:last,:pay)",{'first':emp.first,'last':emp.last,'pay':emp.pay})

def get_emps_by_name(lastname):
  c.execute("select * from employees where last=:last",{'last':lastname})
  return c.fetchall()

def update_pay(emp,pay):
  with conn:
    c.execute("""update employees set pay = :pay
                  where first = :first and last = :last""",
              {'first':emp.first,'last':emp.last,'pay':pay})
def remove_emp(emp):
    with conn:
      c.execute("""delete from employees 
                  where first = :first and last = :last""",
              {'first':emp.first,'last':emp.last})

emp_1 = Employee('John','Doe',80000)
emp_2 = Employee('Jane','Doe',90000)

insert_emp(emp_1)
insert_emp(emp_2)

emps = get_emps_by_name('Doe')
print(emps)

update_pay(emp_2,95000)
remove_emp(emp_1)

emps = get_emps_by_name('Doe')
print(emps)

conn.close()

[('John', 'Doe', 80000), ('Jane', 'Doe', 90000)]
[('Jane', 'Doe', 95000)]